<a href="https://colab.research.google.com/github/sancarhacer/DataSciencewithPython/blob/main/4_IntroToPandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import numpy as np
import pandas as pd
grades = {"Atil" : 50, "James" : 60, "Lars" : 30}
#Series: Pandas’ta tek boyutlu, index–değer ikililerinden oluşan veri yapısıdır; genelde tek sütunluk verileri temsil eder.
#Series günlük hayatta karşımıza çıkmaz çünkü dataframeleri kullanırız
pd.Series(grades)

Atil     50
James    60
Lars     30
dtype: int64

In [ ]:
names = ["Atil", "James", "Lars"]
grades = [50,60,30]
pd.Series(names)

0     Atil
1    James
2     Lars
dtype: object

In [ ]:
pd.Series(grades)

0    50
1    60
2    30
dtype: int64

In [ ]:
pd.Series(data=grades, index=names)

Atil     50
James    60
Lars     30
dtype: int64

In [ ]:
# with numpy
numpy_array = np.array([50,40,30,20])
pd.Series(numpy_array)

0    50
1    40
2    30
3    20
dtype: int64

In [ ]:
#arithmetic
contest_result = pd.Series([10,5,100],["Atil","James","Lars"])
contest_result2 = pd.Series([20,50,10],["Atil","James","Lars"])

In [ ]:
contest_result

Atil      10
James      5
Lars     100
dtype: int64

In [ ]:
contest_result2

Atil     20
James    50
Lars     10
dtype: int64

In [ ]:
contest_result["Atil"]

np.int64(10)

In [ ]:
final_result = contest_result + contest_result2
final_result

Atil      30
James     55
Lars     110
dtype: int64

In [ ]:
contest_result * contest_result2

Atil      200
James     250
Lars     1000
dtype: int64

In [ ]:
contest_result - contest_result2

Atil    -10
James   -45
Lars     90
dtype: int64

In [ ]:
contest_result / contest_result2

Atil      0.5
James     0.1
Lars     10.0
dtype: float64

In [ ]:
# if indices are different
different_series = pd.Series([20,30,40,50],["a","b","c","d"])
different_series_2 = pd.Series([10,5,3,1],["a","c","b","g"])
different_series + different_series_2

a    30.0
b    33.0
c    45.0
d     NaN
g     NaN
dtype: float64